Plan from CI:
```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.catalog_next.aws_security_group.web will be created
  + resource "aws_security_group" "web" {
      + arn                    = (known after apply)
      + description            = "Security group for catalog-next web instance in sandbox"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "catalog-next-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "catalog-next"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_2_8.aws_iam_instance_profile.inventory will be created
  + resource "aws_iam_instance_profile" "inventory" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "inventory_profile-sandbox"
      + path        = "/"
      + role        = "inventory-2-8-sandbox-s3-role"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.inventory_2_8.aws_iam_role.inventory will be created
  + resource "aws_iam_role" "inventory" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "InventoryS3AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "inventory-2-8-sandbox-s3-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.inventory_2_8.aws_iam_role_policy.inventory will be created
  + resource "aws_iam_role_policy" "inventory" {
      + id     = (known after apply)
      + name   = "inventory_s3_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::datagov-appdata-inventory-2-8-sandbox",
                          + "arn:aws:s3:::datagov-appdata-inventory-2-8-sandbox/*",
                        ]
                    },
                  + {
                      + Action   = "S3:ListAllMyBuckets"
                      + Resource = "arn:aws:s3:::*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.inventory_2_8.aws_security_group.inventory will be created
  + resource "aws_security_group" "inventory" {
      + arn                    = (known after apply)
      + description            = "Security group for inventory-2-8 web instance in sandbox"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "inventory-2-8-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "inventory-2-8"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.catalog.module.harvester.aws_instance.default[0] will be updated in-place
  ~ resource "aws_instance" "default" {
        ami                          = "ami-000b3a073fc20e415"
        arn                          = "arn:aws:ec2:us-east-1:587807691409:instance/i-09a9fc45b65036319"
        associate_public_ip_address  = false
        availability_zone            = "us-east-1a"
        cpu_core_count               = 1
        cpu_threads_per_core         = 2
        disable_api_termination      = false
        ebs_optimized                = false
        get_password_data            = false
        hibernation                  = false
        id                           = "i-09a9fc45b65036319"
        instance_state               = "running"
        instance_type                = "t3.medium"
        ipv6_address_count           = 0
        ipv6_addresses               = []
        key_name                     = "datagov-sandbox"
        monitoring                   = false
        primary_network_interface_id = "eni-010db9140ff4b460e"
        private_dns                  = "ip-10-0-1-182.ec2.internal"
        private_ip                   = "10.0.1.182"
        security_groups              = []
        source_dest_check            = true
        subnet_id                    = "subnet-0bbe8705ad1ce9a08"
      ~ tags                         = {
            "Name"  = "catalog-harvester1tf"
            "env"   = "sandbox"
          ~ "group" = "catalog_harvester,v1" -> "catalog_harvester,catalog_harvester_v1,pycsw_worker,v1"
        }
        tenancy                      = "default"
        volume_tags                  = {}
        vpc_security_group_ids       = [
            "sg-04d1f3fdb9f8068a3",
            "sg-0599014293c0c3234",
            "sg-0aea4baa7e28509e9",
            "sg-0cb28298e90b22f14",
            "sg-0e73950e4dbbc9704",
        ]

        credit_specification {
            cpu_credits = "unlimited"
        }

        metadata_options {
            http_endpoint               = "enabled"
            http_put_response_hop_limit = 1
            http_tokens                 = "optional"
        }

        root_block_device {
            delete_on_termination = true
            device_name           = "/dev/sda1"
            encrypted             = false
            iops                  = 100
            volume_id             = "vol-063280056b2bf49ad"
            volume_size           = 8
            volume_type           = "gp2"
        }
    }

  # module.catalog.module.web.aws_instance.web[0] will be updated in-place
  ~ resource "aws_instance" "web" {
        ami                          = "ami-000b3a073fc20e415"
        arn                          = "arn:aws:ec2:us-east-1:587807691409:instance/i-04ae9330f89857726"
        associate_public_ip_address  = false
        availability_zone            = "us-east-1a"
        cpu_core_count               = 1
        cpu_threads_per_core         = 2
        disable_api_termination      = false
        ebs_optimized                = false
        get_password_data            = false
        hibernation                  = false
        id                           = "i-04ae9330f89857726"
        instance_state               = "running"
        instance_type                = "t3.medium"
        ipv6_address_count           = 0
        ipv6_addresses               = []
        key_name                     = "datagov-sandbox"
        monitoring                   = false
        primary_network_interface_id = "eni-0fac1a7fd015d31e5"
        private_dns                  = "ip-10-0-1-82.ec2.internal"
        private_ip                   = "10.0.1.82"
        security_groups              = []
        source_dest_check            = true
        subnet_id                    = "subnet-0bbe8705ad1ce9a08"
      ~ tags                         = {
            "Name"  = "catalog-web1tf"
            "env"   = "sandbox"
          ~ "group" = "catalog_web,v1" -> "catalog_web,catalog_web_v1,pycsw_web,v1"
        }
        tenancy                      = "default"
        volume_tags                  = {}
        vpc_security_group_ids       = [
            "sg-03ac86fa45813a8de",
            "sg-04d1f3fdb9f8068a3",
            "sg-0599014293c0c3234",
            "sg-0cb28298e90b22f14",
            "sg-0e73950e4dbbc9704",
        ]

        credit_specification {
            cpu_credits = "unlimited"
        }

        metadata_options {
            http_endpoint               = "enabled"
            http_put_response_hop_limit = 1
            http_tokens                 = "optional"
        }

        root_block_device {
            delete_on_termination = true
            device_name           = "/dev/sda1"
            encrypted             = false
            iops                  = 100
            volume_id             = "vol-07b17b1a089b3c3f1"
            volume_size           = 8
            volume_type           = "gp2"
        }
    }

  # module.catalog_next.module.harvester.aws_route53_record.default[0] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "catalog-harvester-next1tf"
      + records         = [
          + "ip-10-0-1-253.ec2.internal",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1006361VZ0GA3BRODCA"
    }

  # module.catalog_next.module.redis.aws_security_group.redis will be updated in-place
  ~ resource "aws_security_group" "redis" {
        arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-0373c10a7a607a523"
        description            = "Security group for Redis"
        egress                 = []
        id                     = "sg-0373c10a7a607a523"
      ~ ingress                = [
            {
                cidr_blocks      = []
                description      = ""
                from_port        = 6379
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = (known after apply)
                self             = false
                to_port          = 6379
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05c09cfedb76c0e04",
                ]
              - self             = false
              - to_port          = 6379
            },
        ]
        name                   = "catalog-next-redis-sandbox"
        owner_id               = "587807691409"
        revoke_rules_on_delete = false
        tags                   = {
            "env"  = "sandbox"
            "name" = "catalog-next"
        }
        vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.catalog_next.module.redis.aws_security_group.redis_access will be destroyed
  - resource "aws_security_group" "redis_access" {
      - arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-05c09cfedb76c0e04" -> null
      - description            = "Security group to assign for Redis access." -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/8",
                ]
              - description      = ""
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6379
            },
        ] -> null0m
      - id                     = "sg-05c09cfedb76c0e04" -> null
      - ingress                = [] -> null
      - name                   = "catalog-next-redis-access-sandbox" -> null
      - owner_id               = "587807691409" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "env"  = "sandbox"
          - "name" = "catalog-next"
        } -> null
      - vpc_id                 = "vpc-0e4d22d8b2666bf6f" -> null
    }

  # module.inventory_2_8.module.redis.aws_elasticache_cluster.redis will be created
  + resource "aws_elasticache_cluster" "redis" {
      + apply_immediately      = (known after apply)
      + arn                    = (known after apply)
      + availability_zone      = (known after apply)
      + az_mode                = (known after apply)
      + cache_nodes            = (known after apply)
      + cluster_address        = (known after apply)
      + cluster_id             = "inventory-2-8-sandbox"
      + configuration_endpoint = (known after apply)
      + engine                 = "redis"
      + engine_version         = "5.0.6"
      + id                     = (known after apply)
      + maintenance_window     = (known after apply)
      + node_type              = "cache.t3.small"
      + num_cache_nodes        = 1
      + parameter_group_name   = "default.redis5.0"
      + port                   = 6379
      + replication_group_id   = (known after apply)
      + security_group_ids     = (known after apply)
      + security_group_names   = (known after apply)
      + snapshot_window        = (known after apply)
      + subnet_group_name      = "inventory-2-8-sandbox"
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "inventory-2-8"
        }
    }

  # module.inventory_2_8.module.redis.aws_elasticache_subnet_group.redis will be created
  + resource "aws_elasticache_subnet_group" "redis" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "inventory-2-8-sandbox"
      + subnet_ids  = [
          + "subnet-0bbe8705ad1ce9a08",
          + "subnet-0f531007fa515a1fb",
        ]
    }

  # module.inventory_2_8.module.redis.aws_security_group.redis will be created
  + resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "inventory-2-8-redis-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "inventory-2-8"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_2_8.module.s3.aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "datagov-appdata-inventory-2-8-sandbox"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 10 to add, 3 to change, 1 to destroy.

------------------------------------------------------------------------
```